In [1]:
# Load the pandas package
import pandas as pd

In [2]:
# Load the country.csv data
country = pd.read_csv('country_subset.csv')

In [3]:
# Display the country dataframe
country

               Name Continent  Population
0       Afghanistan      Asia    22720000
1           Albania    Europe     3401200
2           Algeria    Africa    31471000
3    American Samoa   Oceania       68000
4           Andorra    Europe       78000
..              ...       ...         ...
234  Western Sahara    Africa      293000
235           Yemen      Asia    18112000
236      Yugoslavia    Europe    10640000
237          Zambia    Africa     9169000
238        Zimbabwe    Africa    11669000

[239 rows x 3 columns]

In [4]:
# Select the 'Name' column
country['Name']

0         Afghanistan
1             Albania
2             Algeria
3      American Samoa
4             Andorra
            ...
234    Western Sahara
235             Yemen
236        Yugoslavia
237            Zambia
238          Zimbabwe
Name: Name, Length: 239, dtype: object

In [5]:
# Put an extra bracket around the column label to return a dataframe
country[['Name']]

               Name
0       Afghanistan
1           Albania
2           Algeria
3    American Samoa
4           Andorra
..              ...
234  Western Sahara
235           Yemen
236      Yugoslavia
237          Zambia
238        Zimbabwe

[239 rows x 1 columns]

In [6]:
# Select the 'Name' and 'Continent' columns
country[['Name', 'Continent']]

               Name Continent
0       Afghanistan      Asia
1           Albania    Europe
2           Algeria    Africa
3    American Samoa   Oceania
4           Andorra    Europe
..              ...       ...
234  Western Sahara    Africa
235           Yemen      Asia
236      Yugoslavia    Europe
237          Zambia    Africa
238        Zimbabwe    Africa

[239 rows x 2 columns]

In [7]:
# Select the element in row 0 and column 1
country.iloc[0, 1]

'Asia'

In [8]:
# Select rows 0 and 1 and column 1
country.iloc[0:2, 1]

0      Asia
1    Europe
Name: Continent, dtype: object

In [9]:
# Select all rows before row 7 and columns 1 thru 2
country.iloc[:7, 1:3]

       Continent  Population
0           Asia    22720000
1         Europe     3401200
2         Africa    31471000
3        Oceania       68000
4         Europe       78000
5         Africa    12878000
6  North America        8000

In [10]:
# Select rows 10 thru 20 and all columns from column 1 onwards
country.iloc[10:21, 1:]

        Continent  Population
10           Asia     3520000
11  North America      103000
12        Oceania    18886000
13         Europe     8091800
14           Asia     7734000
15  North America      307000
16           Asia      617000
17           Asia   129155000
18  North America      270000
19         Europe    10236000
20         Europe    10239000

In [11]:
# Select rows 10 thru 20 and the Continent and Population columns
country.loc[10:20, ['Continent', 'Population']]

        Continent  Population
10           Asia     3520000
11  North America      103000
12        Oceania    18886000
13         Europe     8091800
14           Asia     7734000
15  North America      307000
16           Asia      617000
17           Asia   129155000
18  North America      270000
19         Europe    10236000
20         Europe    10239000